perf/results/clickhouse/read_200rps.txt
Running 30s test @ http://localhost:9411
  2 threads and 20 connections
  Thread calibration: mean lat.: 4280.992ms, rate sampling interval: 13672ms
  Thread calibration: mean lat.: 4324.018ms, rate sampling interval: 13910ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.95s     5.20s   24.61s    53.90%
    Req/Sec    15.50      0.50    16.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.92s 
 75.000%   20.63s 
 90.000%   23.13s 
 99.000%   24.26s 
 99.900%   24.56s 
 99.990%   24.63s 
 99.999%   24.63s 
100.000%   24.63s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7061.503     0.000000            1         1.00
    8863.743     0.100000           63         1.11
   10117.119     0.200000          126         1.25
   12017.663     0.300000          189         1.43
   14311.423     0.400000          252         1.67
   15917.055     0.500000          315         2.00
   17104.895     0.550000          348         2.22
   17842.175     0.600000          379         2.50
   18431.999     0.650000          409         2.86
   19038.207     0.700000          441         3.33
   20627.455     0.750000          472         4.00
   21561.343     0.775000          488         4.44
   22118.399     0.800000          504         5.00
   22347.775     0.825000          519         5.71
   22609.919     0.850000          536         6.67
   22953.983     0.875000          554         8.00
   23052.287     0.887500          560         8.89
   23183.359     0.900000          567        10.00
   23298.047     0.912500          574        11.43
   23379.967     0.925000          582        13.33
   23560.191     0.937500          591        16.00
   23691.263     0.943750          595        17.78
   23724.031     0.950000          598        20.00
   23822.335     0.956250          602        22.86
   23904.255     0.962500          606        26.67
   23986.175     0.968750          610        32.00
   24018.943     0.971875          612        35.56
   24084.479     0.975000          615        40.00
   24117.247     0.978125          617        45.71
   24166.399     0.981250          618        53.33
   24182.783     0.984375          620        64.00
   24231.935     0.985938          621        71.11
   24248.319     0.987500          622        80.00
   24264.703     0.989062          623        91.43
   24281.087     0.990625          624       106.67
   24428.543     0.992188          625       128.00
   24428.543     0.992969          625       142.22
   24477.695     0.993750          626       160.00
   24477.695     0.994531          626       182.86
   24494.079     0.995313          627       213.33
   24494.079     0.996094          627       256.00
   24494.079     0.996484          627       284.44
   24559.615     0.996875          628       320.00
   24559.615     0.997266          628       365.71
   24559.615     0.997656          628       426.67
   24559.615     0.998047          628       512.00
   24559.615     0.998242          628       568.89
   24625.151     0.998437          629       640.00
   24625.151     1.000000          629          inf
#[Mean    =    15946.955, StdDeviation   =     5196.989]
#[Max     =    24608.768, Total count    =          629]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1150 requests in 30.03s, 1.60MB read
  Non-2xx or 3xx responses: 88
Requests/sec:     38.30
Transfer/sec:     54.63KB