perf/results/clickhouse/write_1000rps.txt
Running 30s test @ http://localhost:9411
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.639ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.656ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.633ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.628ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.54ms    1.20ms  20.30ms   96.62%
    Req/Sec   263.74     95.42   777.00     78.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.40ms
 75.000%    1.79ms
 90.000%    2.20ms
 99.000%    6.63ms
 99.900%   15.83ms
 99.990%   19.33ms
 99.999%   20.32ms
100.000%   20.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.185     0.000000            1         1.00
       0.729     0.100000         2002         1.11
       0.941     0.200000         3987         1.25
       1.117     0.300000         5992         1.43
       1.267     0.400000         7980         1.67
       1.404     0.500000         9970         2.00
       1.471     0.550000        10965         2.22
       1.546     0.600000        11968         2.50
       1.622     0.650000        12971         2.86
       1.702     0.700000        13961         3.33
       1.794     0.750000        14952         4.00
       1.848     0.775000        15453         4.44
       1.902     0.800000        15958         5.00
       1.958     0.825000        16450         5.71
       2.025     0.850000        16951         6.67
       2.107     0.875000        17453         8.00
       2.149     0.887500        17695         8.89
       2.199     0.900000        17945        10.00
       2.251     0.912500        18190        11.43
       2.311     0.925000        18445        13.33
       2.375     0.937500        18693        16.00
       2.419     0.943750        18822        17.78
       2.463     0.950000        18939        20.00
       2.513     0.956250        19066        22.86
       2.577     0.962500        19187        26.67
       2.687     0.968750        19313        32.00
       2.759     0.971875        19376        35.56
       2.839     0.975000        19436        40.00
       3.067     0.978125        19498        45.71
       3.527     0.981250        19561        53.33
       4.511     0.984375        19623        64.00
       4.903     0.985938        19654        71.11
       5.427     0.987500        19685        80.00
       6.019     0.989062        19716        91.43
       7.175     0.990625        19748       106.67
       8.391     0.992188        19779       128.00
       8.951     0.992969        19794       142.22
       9.415     0.993750        19810       160.00
      10.055     0.994531        19825       182.86
      10.791     0.995313        19841       213.33
      11.711     0.996094        19857       256.00
      12.527     0.996484        19865       284.44
      12.639     0.996875        19872       320.00
      13.223     0.997266        19880       365.71
      13.679     0.997656        19888       426.67
      14.327     0.998047        19896       512.00
      14.455     0.998242        19899       568.89
      14.911     0.998437        19903       640.00
      15.239     0.998633        19907       731.43
      15.519     0.998828        19911       853.33
      15.887     0.999023        19915      1024.00
      16.495     0.999121        19917      1137.78
      16.511     0.999219        19919      1280.00
      16.575     0.999316        19921      1462.86
      17.039     0.999414        19923      1706.67
      17.615     0.999512        19925      2048.00
      17.647     0.999561        19926      2275.56
      17.711     0.999609        19927      2560.00
      18.303     0.999658        19928      2925.71
      18.815     0.999707        19929      3413.33
      19.247     0.999756        19930      4096.00
      19.247     0.999780        19930      4551.11
      19.279     0.999805        19931      5120.00
      19.279     0.999829        19931      5851.43
      19.327     0.999854        19932      6826.67
      19.327     0.999878        19932      8192.00
      19.327     0.999890        19932      9102.22
      20.303     0.999902        19933     10240.00
      20.303     0.999915        19933     11702.86
      20.303     0.999927        19933     13653.33
      20.303     0.999939        19933     16384.00
      20.303     0.999945        19933     18204.44
      20.319     0.999951        19934     20480.00
      20.319     1.000000        19934          inf
#[Mean    =        1.544, StdDeviation   =        1.204]
#[Max     =       20.304, Total count    =        19934]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29994 requests in 30.00s, 3.00MB read
Requests/sec:    999.75
Transfer/sec:    102.51KB